Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.3.61/samv70b/atdf/ATSAMV70N20B.atdf
        <register caption="Write Protection Mode Register" name="EEFC_WPMR" offset="0xE4" rw="RW" size="4">
          <bitfield caption="Write Protection Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protection Key" mask="0xFFFFFF00" name="WPKEY" values="EEFC_WPMR__WPKEY"/>
        </register>
      </register-group>
      <value-group caption="" name="EEFC_FCR__FCMD">
        <value caption="Get Flash descriptor" name="GETD" value="0x00"/>
        <value caption="Write page" name="WP" value="0x01"/>
        <value caption="Write page and lock" name="WPL" value="0x02"/>
        <value caption="Erase page and write page" name="EWP" value="0x03"/>
        <value caption="Erase page and write page then lock" name="EWPL" value="0x04"/>
        <value caption="Erase all" name="EA" value="0x05"/>
        <value caption="Erase pages" name="EPA" value="0x07"/>
        <value caption="Set lock bit" name="SLB" value="0x08"/>
        <value caption="Clear lock bit" name="CLB" value="0x09"/>
        <value caption="Get lock bit" name="GLB" value="0x0A"/>
        <value caption="Set GPNVM bit" name="SGPB" value="0x0B"/>
        <value caption="Clear GPNVM bit" name="CGPB" value="0x0C"/>
        <value caption="Get GPNVM bit" name="GGPB" value="0x0D"/>
        <value caption="Start read unique identifier" name="STUI" value="0x0E"/>
        <value caption="Stop read unique identifier" name="SPUI" value="0x0F"/>
        <value caption="Get CALIB bit" name="GCALB" value="0x10"/>
        <value caption="Erase sector" name="ES" value="0x11"/>
        <value caption="Write user signature" name="WUS" value="0x12"/>
        <value caption="Erase user signature" name="EUS" value="0x13"/>
        <value caption="Start read user signature" name="STUS" value="0x14"/>
        <value caption="Stop read user signature" name="SPUS" value="0x15"/>
      </value-group>
      <value-group caption="" name="EEFC_FCR__FKEY">
        <value caption="The 0x5A value enables the command defined by the bits of the register. If the field is written with a different value, the write is not performed and no action is started." name="PASSWD" value="0x5A"/>
      </value-group>
      <value-group caption="" name="EEFC_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation.Always reads as 0." name="PASSWD" value="0x454643"/>
      </value-group>
    </module>
    <module name="GPBR" caption="General Purpose Backup Registers" id="6378" version="J">
      <register-group name="GPBR">
        <register caption="General Purpose Backup Register 0" name="SYS_GPBR" offset="0x0" rw="RW" size="4" count="8">
          <bitfield caption="Value of GPBR x" mask="0xFFFFFFFF" name="GPBR_VALUE"/>
        </register>
      </register-group>
    </module>
    <module name="HSMCI" caption="High Speed MultiMedia Card Interface" id="6449" version="R">
      <register-group name="HSMCI">
        <register caption="Control Register" name="HSMCI_CR" offset="0x00" rw="W" size="4">
          <bitfield caption="Multi-Media Interface Enable" mask="0x00000001" name="MCIEN"/>
          <bitfield caption="Multi-Media Interface Disable" mask="0x00000002" name="MCIDIS"/>
          <bitfield caption="Power Save Mode Enable" mask="0x00000004" name="PWSEN"/>
          <bitfield caption="Power Save Mode Disable" mask="0x00000008" name="PWSDIS"/>
          <bitfield caption="Software Reset" mask="0x00000080" name="SWRST"/>
        </register>
        <register caption="Mode Register" name="HSMCI_MR" offset="0x04" rw="RW" size="4">
          <bitfield caption="Clock Divider" mask="0x000000FF" name="CLKDIV"/>
          <bitfield caption="Power Saving Divider" mask="0x00000700" name="PWSDIV"/>
          <bitfield caption="Read Proof Enable" mask="0x00000800" name="RDPROOF"/>
          <bitfield caption="Write Proof Enable" mask="0x00001000" name="WRPROOF"/>
          <bitfield caption="Force Byte Transfer" mask="0x00002000" name="FBYTE"/>
          <bitfield caption="Padding Value" mask="0x00004000" name="PADV"/>
          <bitfield caption="Clock divider is odd" mask="0x00010000" name="CLKODD"/>
        </register>
        <register caption="Data Timeout Register" name="HSMCI_DTOR" offset="0x08" rw="RW" size="4">
          <bitfield caption="Data Timeout Cycle Number" mask="0x0000000F" name="DTOCYC"/>
          <bitfield caption="Data Timeout Multiplier" mask="0x00000070" name="DTOMUL" values="HSMCI_DTOR__DTOMUL"/>
        </register>
        <register caption="SD/SDIO Card Register" name="HSMCI_SDCR" offset="0x0C" rw="RW" size="4">
          <bitfield caption="SDCard/SDIO Slot" mask="0x00000003" name="SDCSEL" values="HSMCI_SDCR__SDCSEL"/>
          <bitfield caption="SDCard/SDIO Bus Width" mask="0x000000C0" name="SDCBUS" values="HSMCI_SDCR__SDCBUS"/>
        </register>
        <register caption="Argument Register" name="HSMCI_ARGR" offset="0x10" rw="RW" size="4">
          <bitfield caption="Command Argument" mask="0xFFFFFFFF" name="ARG"/>
        </register>
        <register caption="Command Register" name="HSMCI_CMDR" offset="0x14" rw="W" size="4">
          <bitfield caption="Command Number" mask="0x0000003F" name="CMDNB"/>
          <bitfield caption="Response Type" mask="0x000000C0" name="RSPTYP" values="HSMCI_CMDR__RSPTYP"/>
          <bitfield caption="Special Command" mask="0x00000700" name="SPCMD" values="HSMCI_CMDR__SPCMD"/>
          <bitfield caption="Open Drain Command" mask="0x00000800" name="OPDCMD" values="HSMCI_CMDR__OPDCMD"/>
          <bitfield caption="Max Latency for Command to Response" mask="0x00001000" name="MAXLAT" values="HSMCI_CMDR__MAXLAT"/>
          <bitfield caption="Transfer Command" mask="0x00030000" name="TRCMD" values="HSMCI_CMDR__TRCMD"/>
          <bitfield caption="Transfer Direction" mask="0x00040000" name="TRDIR" values="HSMCI_CMDR__TRDIR"/>
          <bitfield caption="Transfer Type" mask="0x00380000" name="TRTYP" values="HSMCI_CMDR__TRTYP"/>
          <bitfield caption="SDIO Special Command" mask="0x03000000" name="IOSPCMD" values="HSMCI_CMDR__IOSPCMD"/>
          <bitfield caption="ATA with Command Completion Signal" mask="0x04000000" name="ATACS" values="HSMCI_CMDR__ATACS"/>
          <bitfield caption="Boot Operation Acknowledge" mask="0x08000000" name="BOOT_ACK"/>
        </register>
        <register caption="Block Register" name="HSMCI_BLKR" offset="0x18" rw="RW" size="4">
          <bitfield caption="MMC/SDIO Block Count - SDIO Byte Count" mask="0x0000FFFF" name="BCNT"/>
          <bitfield caption="Data Block Length" mask="0xFFFF0000" name="BLKLEN"/>
        </register>
        <register caption="Completion Signal Timeout Register" name="HSMCI_CSTOR" offset="0x1C" rw="RW" size="4">
          <bitfield caption="Completion Signal Timeout Cycle Number" mask="0x0000000F" name="CSTOCYC"/>
          <bitfield caption="Completion Signal Timeout Multiplier" mask="0x00000070" name="CSTOMUL" values="HSMCI_CSTOR__CSTOMUL"/>
        </register>
        <register caption="Response Register 0" name="HSMCI_RSPR" offset="0x20" rw="R" size="4" count="4">
          <bitfield caption="Response" mask="0xFFFFFFFF" name="RSP"/>
        </register>
