Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.3.61/samv70b/atdf/ATSAMV70N20B.atdf
      <value-group name="STKALIGN">
        <value value="0" name="VALUE_0" caption="4-byte aligned"/>
        <value value="1" name="VALUE_1" caption="8-byte aligned"/>
      </value-group>
      <value-group name="MEMFAULTACT">
        <value value="0" name="VALUE_0" caption="exception is not active"/>
        <value value="1" name="VALUE_1" caption="exception is active"/>
      </value-group>
      <value-group name="BUSFAULTACT">
        <value value="0" name="VALUE_0" caption="exception is not active"/>
        <value value="1" name="VALUE_1" caption="exception is active"/>
      </value-group>
      <value-group name="USGFAULTACT">
        <value value="0" name="VALUE_0" caption="exception is not active"/>
        <value value="1" name="VALUE_1" caption="exception is active"/>
      </value-group>
      <value-group name="SVCALLACT">
        <value value="0" name="VALUE_0" caption="exception is not active"/>
        <value value="1" name="VALUE_1" caption="exception is active"/>
      </value-group>
      <value-group name="MONITORACT">
        <value value="0" name="VALUE_0" caption="exception is not active"/>
        <value value="1" name="VALUE_1" caption="exception is active"/>
      </value-group>
      <value-group name="PENDSVACT">
        <value value="0" name="VALUE_0" caption="exception is not active"/>
        <value value="1" name="VALUE_1" caption="exception is active"/>
      </value-group>
      <value-group name="SYSTICKACT">
        <value value="0" name="VALUE_0" caption="exception is not active"/>
        <value value="1" name="VALUE_1" caption="exception is active"/>
      </value-group>
      <value-group name="USGFAULTPENDED">
        <value value="0" name="VALUE_0" caption="exception is not pending"/>
        <value value="1" name="VALUE_1" caption="exception is pending"/>
      </value-group>
      <value-group name="MEMFAULTPENDED">
        <value value="0" name="VALUE_0" caption="exception is not pending"/>
        <value value="1" name="VALUE_1" caption="exception is pending"/>
      </value-group>
      <value-group name="BUSFAULTPENDED">
        <value value="0" name="VALUE_0" caption="exception is not pending"/>
        <value value="1" name="VALUE_1" caption="exception is pending"/>
      </value-group>
      <value-group name="SVCALLPENDED">
        <value value="0" name="VALUE_0" caption="exception is not pending"/>
        <value value="1" name="VALUE_1" caption="exception is pending"/>
      </value-group>
      <value-group name="MEMFAULTENA">
        <value value="0" name="VALUE_0" caption="disable the exception"/>
        <value value="1" name="VALUE_1" caption="enable the exception"/>
      </value-group>
      <value-group name="BUSFAULTENA">
        <value value="0" name="VALUE_0" caption="disable the exception"/>
        <value value="1" name="VALUE_1" caption="enable the exception"/>
      </value-group>
      <value-group name="USGFAULTENA">
        <value value="0" name="VALUE_0" caption="disable the exception"/>
        <value value="1" name="VALUE_1" caption="enable the exception"/>
      </value-group>
      <value-group name="IACCVIOL">
        <value value="0" name="VALUE_0" caption="no instruction access violation fault"/>
        <value value="1" name="VALUE_1" caption="the processor attempted an instruction fetch from a location that does not permit execution"/>
      </value-group>
      <value-group name="DACCVIOL">
        <value value="0" name="VALUE_0" caption="no data access violation fault"/>
        <value value="1" name="VALUE_1" caption="the processor attempted a load or store at a location that does not permit the operation"/>
      </value-group>
      <value-group name="MUNSTKERR">
        <value value="0" name="VALUE_0" caption="no unstacking fault"/>
        <value value="1" name="VALUE_1" caption="unstack for an exception return has caused one or more access violations"/>
      </value-group>
      <value-group name="MSTKERR">
        <value value="0" name="VALUE_0" caption="no stacking fault"/>
        <value value="1" name="VALUE_1" caption="stacking for an exception entry has caused one or more access violations"/>
      </value-group>
      <value-group name="MLSPERR">
        <value value="0" name="VALUE_0" caption="No MemManage fault occurred during floating-point lazy state preservation"/>
        <value value="1" name="VALUE_1" caption="A MemManage fault occurred during floating-point lazy state preservation"/>
      </value-group>
      <value-group name="MMARVALID">
        <value value="0" name="VALUE_0" caption="value in MMAR is not a valid fault address"/>
        <value value="1" name="VALUE_1" caption="MMAR holds a valid fault address"/>
      </value-group>
      <value-group name="IBUSERR">
        <value value="0" name="VALUE_0" caption="no instruction bus error"/>
        <value value="1" name="VALUE_1" caption="instruction bus error"/>
      </value-group>
      <value-group name="PRECISERR">
        <value value="0" name="VALUE_0" caption="no precise data bus error"/>
        <value value="1" name="VALUE_1" caption="a data bus error has occurred, and the PC value stacked for the exception return points to the instruction that caused the fault"/>
      </value-group>
      <value-group name="IMPRECISERR">
        <value value="0" name="VALUE_0" caption="no imprecise data bus error"/>
        <value value="1" name="VALUE_1" caption="a data bus error has occurred, but the return address in the stack frame is not related to the instruction that caused the error"/>
      </value-group>
      <value-group name="UNSTKERR">
        <value value="0" name="VALUE_0" caption="no unstacking fault"/>
        <value value="1" name="VALUE_1" caption="unstack for an exception return has caused one or more BusFaults"/>
      </value-group>
      <value-group name="STKERR">
        <value value="0" name="VALUE_0" caption="no stacking fault"/>
        <value value="1" name="VALUE_1" caption="stacking for an exception entry has caused one or more BusFaults"/>
      </value-group>
      <value-group name="LSPERR">
        <value value="0" name="VALUE_0" caption="No bus fault occurred during floating-point lazy state preservation"/>
        <value value="1" name="VALUE_1" caption="A bus fault occurred during floating-point lazy state preservation"/>
      </value-group>
